{"format": "layers-model", "generatedBy": "keras v2.2.4-tf", "convertedBy": "TensorFlow.js Converter v1.2.10.1", "modelTopology": {"keras_version": "2.2.4-tf", "backend": "tensorflow", "model_config": {"class_name": "Model", "config": {"name": "model_1", "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 128], "dtype": "float32", "sparse": false, "name": "input_3"}, "name": "input_3", "inbound_nodes": []}, {"class_name": "Dense", "config": {"name": "dense_1", "trainable": true, "dtype": "float32", "units": 18432, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "dense_1", "inbound_nodes": [[["input_3", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_4", "trainable": true, "dtype": "float32", "axis": [1], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_4", "inbound_nodes": [[["dense_1", 0, 0, {}]]]}, {"class_name": "LeakyReLU", "config": {"name": "leaky_re_lu_4", "trainable": true, "dtype": "float32", "alpha": 0.30000001192092896}, "name": "leaky_re_lu_4", "inbound_nodes": [[["batch_normalization_4", 0, 0, {}]]]}, {"class_name": "Reshape", "config": {"name": "reshape_3", "trainable": true, "dtype": "float32", "target_shape": [8, 9, 256]}, "name": "reshape_3", "inbound_nodes": [[["leaky_re_lu_4", 0, 0, {}]]]}, {"class_name": "Conv2DTranspose", "config": {"name": "conv2d_transpose_3", "trainable": true, "dtype": "float32", "filters": 128, "kernel_size": [5, 5], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "output_padding": null}, "name": "conv2d_transpose_3", "inbound_nodes": [[["reshape_3", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_5", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_5", "inbound_nodes": [[["conv2d_transpose_3", 0, 0, {}]]]}, {"class_name": "LeakyReLU", "config": {"name": "leaky_re_lu_5", "trainable": true, "dtype": "float32", "alpha": 0.30000001192092896}, "name": "leaky_re_lu_5", "inbound_nodes": [[["batch_normalization_5", 0, 0, {}]]]}, {"class_name": "Conv2DTranspose", "config": {"name": "conv2d_transpose_4", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [5, 5], "strides": [2, 2], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "output_padding": null}, "name": "conv2d_transpose_4", "inbound_nodes": [[["leaky_re_lu_5", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_6", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_6", "inbound_nodes": [[["conv2d_transpose_4", 0, 0, {}]]]}, {"class_name": "InputLayer", "config": {"batch_input_shape": [null, 32, 36], "dtype": "float32", "sparse": false, "name": "input_4"}, "name": "input_4", "inbound_nodes": []}, {"class_name": "LeakyReLU", "config": {"name": "leaky_re_lu_6", "trainable": true, "dtype": "float32", "alpha": 0.30000001192092896}, "name": "leaky_re_lu_6", "inbound_nodes": [[["batch_normalization_6", 0, 0, {}]]]}, {"class_name": "Reshape", "config": {"name": "reshape_4", "trainable": true, "dtype": "float32", "target_shape": [32, 36, 1]}, "name": "reshape_4", "inbound_nodes": [[["input_4", 0, 0, {}]]]}, {"class_name": "Conv2DTranspose", "config": {"name": "conv2d_transpose_5", "trainable": true, "dtype": "float32", "filters": 16, "kernel_size": [5, 5], "strides": [2, 2], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "output_padding": null}, "name": "conv2d_transpose_5", "inbound_nodes": [[["leaky_re_lu_6", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_2", "trainable": true, "dtype": "float32", "filters": 16, "kernel_size": [5, 5], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "sigmoid", "use_bias": false, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_2", "inbound_nodes": [[["reshape_4", 0, 0, {}]]]}, {"class_name": "Multiply", "config": {"name": "multiply_1", "trainable": true, "dtype": "float32"}, "name": "multiply_1", "inbound_nodes": [[["conv2d_transpose_5", 0, 0, {}], ["conv2d_2", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_7", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_7", "inbound_nodes": [[["multiply_1", 0, 0, {}]]]}, {"class_name": "LeakyReLU", "config": {"name": "leaky_re_lu_7", "trainable": true, "dtype": "float32", "alpha": 0.30000001192092896}, "name": "leaky_re_lu_7", "inbound_nodes": [[["batch_normalization_7", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_3", "trainable": true, "dtype": "float32", "filters": 1, "kernel_size": [5, 5], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "tanh", "use_bias": false, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_3", "inbound_nodes": [[["leaky_re_lu_7", 0, 0, {}]]]}, {"class_name": "Reshape", "config": {"name": "reshape_5", "trainable": true, "dtype": "float32", "target_shape": [32, 36]}, "name": "reshape_5", "inbound_nodes": [[["conv2d_3", 0, 0, {}]]]}], "input_layers": [["input_3", 0, 0], ["input_4", 0, 0]], "output_layers": [["reshape_5", 0, 0]]}}}, "weightsManifest": [{"paths": ["group1-shard1of1.bin"], "weights": [{"name": "batch_normalization_4/gamma", "shape": [18432], "dtype": "float32", "quantization": {"min": 0.7104599475860596, "scale": 0.0032776467940386603, "dtype": "uint8"}}, {"name": "batch_normalization_4/beta", "shape": [18432], "dtype": "float32", "quantization": {"min": -0.41583100814445345, "scale": 0.004243173552494423, "dtype": "uint8"}}, {"name": "batch_normalization_4/moving_mean", "shape": [18432], "dtype": "float32", "quantization": {"min": -0.00470097468179815, "scale": 3.730932287141389e-05, "dtype": "uint8"}}, {"name": "batch_normalization_4/moving_variance", "shape": [18432], "dtype": "float32", "quantization": {"min": 0.07052971422672272, "scale": 0.00013614296913146972, "dtype": "uint8"}}, {"name": "batch_normalization_5/gamma", "shape": [128], "dtype": "float32", "quantization": {"min": 0.9050753116607666, "scale": 0.0009565694659363989, "dtype": "uint8"}}, {"name": "batch_normalization_5/beta", "shape": [128], "dtype": "float32", "quantization": {"min": -0.4687123338381449, "scale": 0.0025064830686531816, "dtype": "uint8"}}, {"name": "batch_normalization_5/moving_mean", "shape": [128], "dtype": "float32", "quantization": {"min": -24.434045716827992, "scale": 0.19547236573462393, "dtype": "uint8"}}, {"name": "batch_normalization_5/moving_variance", "shape": [128], "dtype": "float32", "quantization": {"min": 177.5779266357422, "scale": 2.651103001014859, "dtype": "uint8"}}, {"name": "batch_normalization_6/gamma", "shape": [64], "dtype": "float32", "quantization": {"min": 0.9079349040985107, "scale": 0.00088805544610117, "dtype": "uint8"}}, {"name": "batch_normalization_6/beta", "shape": [64], "dtype": "float32", "quantization": {"min": -0.3386429244396733, "scale": 0.0024188780317119522, "dtype": "uint8"}}, {"name": "batch_normalization_6/moving_mean", "shape": [64], "dtype": "float32", "quantization": {"min": -2.487838301004148, "scale": 0.016050569683897727, "dtype": "uint8"}}, {"name": "batch_normalization_6/moving_variance", "shape": [64], "dtype": "float32", "quantization": {"min": 3.7718026638031006, "scale": 0.16513327149783863, "dtype": "uint8"}}, {"name": "batch_normalization_7/gamma", "shape": [16], "dtype": "float32", "quantization": {"min": 1.4792321920394897, "scale": 0.003986607813367657, "dtype": "uint8"}}, {"name": "batch_normalization_7/beta", "shape": [16], "dtype": "float32", "quantization": {"min": -0.035140311075191874, "scale": 0.001351550425968918, "dtype": "uint8"}}, {"name": "batch_normalization_7/moving_mean", "shape": [16], "dtype": "float32", "quantization": {"min": -0.21830641627311706, "scale": 0.006420776949209325, "dtype": "uint8"}}, {"name": "batch_normalization_7/moving_variance", "shape": [16], "dtype": "float32", "quantization": {"min": 0.011615167371928692, "scale": 0.002869130075708324, "dtype": "uint8"}}, {"name": "conv2d_2/kernel", "shape": [5, 5, 1, 16], "dtype": "float32", "quantization": {"min": -0.6918932760463041, "scale": 0.007687703067181157, "dtype": "uint8"}}, {"name": "conv2d_3/kernel", "shape": [5, 5, 16, 1], "dtype": "float32", "quantization": {"min": -1.079272777893964, "scale": 0.007341991686353497, "dtype": "uint8"}}, {"name": "conv2d_transpose_3/kernel", "shape": [5, 5, 128, 256], "dtype": "float32", "quantization": {"min": -0.19748276647399454, "scale": 0.0021942529608221617, "dtype": "uint8"}}, {"name": "conv2d_transpose_4/kernel", "shape": [5, 5, 64, 128], "dtype": "float32", "quantization": {"min": -0.23736461909378276, "scale": 0.001758256437731724, "dtype": "uint8"}}, {"name": "conv2d_transpose_5/kernel", "shape": [5, 5, 16, 64], "dtype": "float32", "quantization": {"min": -0.21587082124223897, "scale": 0.002075680973483067, "dtype": "uint8"}}, {"name": "dense_1/kernel", "shape": [128, 18432], "dtype": "float32", "quantization": {"min": -0.12291931077545765, "scale": 0.0009603071154332629, "dtype": "uint8"}}]}]}